app/Models/GoatModel.php

    public function getStats(): array
    {
        $db    = \Config\Database::connect();
        $total = $db->table('goats')->where('status','active')->countAllResults();
        $banking = $db->table('goats')->where('status','active')->where('member_id IS NOT NULL')->countAllResults();
        $flagged = $db->table('goats g')
            ->join('vet_visits v','v.goat_id = g.id AND v.is_flagged = 1 AND v.flag_resolved_at IS NULL','left')
            ->where('g.status','active')->where('v.id IS NOT NULL')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `goats`
WHERE `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `goats`
WHERE `status` = 'active'
AND `member_id` IS NOT NULL
SELECT COUNT(*) AS `numrows`
FROM `goats` `g`
LEFT JOIN `vet_visits` `v` ON `v`.`goat_id` = `g`.`id` AND `v`.`is_flagged` = 1 AND `v`.`flag_resolved_at` IS NULL
WHERE `g`.`status` = 'active'
AND `v`.`id` IS NOT NULL