app/Models/MemberApplicationModel.php

SELECT *
FROM `member_applications`
WHERE `status` = 'pending'
ORDER BY `created_at` DESC
SELECT COUNT(*) AS `numrows`
FROM `member_applications`
WHERE `status` = 'pending'
---
    public function getPending(): array   { return $this->where('status','pending')->orderBy('created_at','DESC')->findAll(); }
    public function countPending(): int   { return $this->where('status','pending')->countAllResults(); }