app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'admin@mdgoatco.com'
AND `deleted_at` IS NULL
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    public function findByEmail(string $email): ?array
    {
        return $this->where('email', $email)
                    ->where('deleted_at', null)
                    ->first();