app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'admin@mdgoatco.farm'
AND `deleted_at` IS NULL
 LIMIT 1
---
    public function findByEmail(string $email): ?array
    {
        return $this->where('email', $email)->where('deleted_at', null)->first();

UPDATE `users` SET `last_login_at` = '2026-07-04 21:15:59', `updated_at` = '2026-07-04 21:15:59'
WHERE `users`.`id` IN (1)
---
    public function updateLastLogin(int $id): void { $this->update($id, ['last_login_at'=>date('Y-m-d H:i:s')]); }

SELECT *
FROM `users`
WHERE `role` = 'member'
AND `deleted_at` IS NULL
---
    public function getByRole(string $role): array { return $this->where('role',$role)->where('deleted_at',null)->findAll(); }

SELECT *
FROM `users`
WHERE `role` IN ('manager','vet','super_admin')
AND `deleted_at` IS NULL
---
    public function getStaff(): array
    {
        return $this->whereIn('role',['manager','vet','super_admin'])->where('deleted_at',null)->findAll();

SELECT `role`, COUNT(*) as cnt
FROM `users`
WHERE `deleted_at` IS NULL
GROUP BY `role`
---
    public function countByRole(): array
    {
        $rows = $this->select('role, COUNT(*) as cnt')->where('deleted_at',null)->groupBy('role')->findAll();