app/Modules/Admin/Controllers/PaymentController.php

    public function export()
    {
        $rows = $this->paymentsQuery($this->searchTerm())->get()->getResultArray();
---
SELECT `p`.*, `p`.`merchant_reference` as `reference`, `u`.`first_name`, `u`.`last_name`, `u`.`email`
FROM `payments` `p`
LEFT JOIN `users` `u` ON `u`.`id`=`p`.`member_id`
ORDER BY `p`.`created_at` DESC