app/Modules/Admin/Controllers/StaffController.php

SELECT *
FROM `users`
WHERE `users`.`id` = 1
---
    public function edit(int $id): string
    {
        $user = $this->users->find($id);
        if (! $user) return redirect()->to('/admin/staff')->with('error','User not found.');